import { vowel } from './pinyin'
import pinyin from 'pinyin'
const yun1 = [
  '啊扒巴疤笆叉杈差咖瓜呱哈花哗加茄笳迦痂袈嘉佳家夸啦妈摩趴葩杉沙挲莎痧鲨纱他她它哇洼蛙娲虾丫呀鸦哑查呱呵拉吗仨裟渣'.split(''),
  '阿八捌插耷哒搭发夹刮括垃抹掐杀刹煞刷塌踏挖瞎鸭压押扎匝撒答'.split(''),
  '啊茶查搽槎楂华哗骅麻嘛拿扒爬耙琶娃霞暇瑕牙伢芽崖涯衙'.split(''),
  '拔察达沓答瘩乏伐阀筏罚滑划猾夹颊拉匣狎峡黠杂砸扎札轧炸闸铡'.split(''),
  '把靶叉衩打剐寡哈贾假卡咔侉垮喇俩马吗玛码蚂哪卡洒傻耍瓦哑扠雅咋诈爪'.split(''),
  '法甲撒塔眨獭'.split(''),
  '坝把爸耙罢霸衩诧差大卦挂褂化划画话桦价驾架假嫁稼挎胯落跨骂那娜怕下夏厦亚炸榨瓦'.split(''),
  '刹发划剌腊蜡辣纳帕恰洽卅飒萨歃煞拓榻踏蹋袜吓轧压栅'.split(''),
]
const yun4 = [
  '微陂杯卑悲碑衰崔催摧吹炊堆墩飞妃非菲绯扉霏归龟规皈闺黑嘿瑰傀灰诙挥恢晖辉翚麾徽亏岿勒悝盔窥呸胚虽忒推危委萎威逶偎隈葳煨激巍追骓椎锥'.split(''),
  '垂陲捶椎槌锤肥回茴徊洄蛔奎逵馗葵揆睽魁累雷缧擂雷羸玫枚眉莓梅嵋湄媒煤酶霉糜陪培赔没裴蕤绥隋遂谁颓韦为贼违围帏桅唯薇维嵬巍闱'.split(''),
  '匪诽菲翡蜚给轨诡鬼悔毁累耒垒磊蕾儡美每蕊水髓腿伟苇唯尾娓委诿萎痿猥嘴北'.split(''),
  '贝狈钡吹备背被辈孛悖倍焙蓓惫臂萃淬粹翠脆对兑队芾肺沸费废吠柜刽桧贵桂跪鳜会惠秽诲晦慧卉汇蕙讳贿绘馈溃愧聩泪类累肋妹昧寐魅袂媚内沛佩配辔锐瑞睿睡税说岁祟遂碎隧燧穗退蜕未味胃谓猥畏渭尉卫位遗魏为坠缀惴赘最罪醉'.split(''),
]
const yun7 = [
  '抽丢都兜勾沟钩篝纠鸠究赳揪溜搂妞沤瓯呕欧殴鸥丘邱秋蚯收搜飕廋艘偷修休羞馐优忧悠幽舟州诌周粥'.split(''),
  '畴踌绸仇稠愁侯猴流留榴刘浏瘤遛瘤楼耧牟件眸谋牛抔囚仇求泅酋球裘柔揉头投尤犹由邮油游'.split(''),
  '丑瞅斗抖蚪陡缶苟狗吼九久韭酒口柳搂篓某扭忸偶呕藕手首守擞朽宿友有酉莠帚肘走'.split(''),
  '臭凑豆逗读窦斗垢构购勾诟够后候厚舅就疚旧救厩柩扣叩寇蔻溜遛陋露漏拗沤怄受授寿狩售绶瘦擞嗽透秀绣岫袖臭嗅宿又右幼有佑诱秞咒纣宙胄昼皺骤籀奏揍'.split(''),
]
const yun9 = [
  '奔宾彬斌滨摈缤濒参嗔春椿村皴惇吨墩敦蹲恩分芬纷氛根跟昏荤婚巾今斤金津衿筋襟禁军均君龟钧皲麇坤昆崑抡拎闷喷拼姘钦侵亲衾森申伸身呻绅莘娠深孙狲吞暾温瘟心芯辛忻欣新薪馨鑫勋熏薰醺因阴茵荫音姻氲殷晕贞针侦珍真砧斟甄箴臻谆尊樽'.split(''),
  '岑臣橙尘辰沉忱陈晨纯唇淳醇存蹲坟汾焚痕浑馄混魂邻林临淋琳磷鳞麟仑伦论抡纶沦轮门扪们民您盆贫频颦芹秦琴矜禽勤擒噙裙群人仁任神什屯囤豚臀文纹闻蚊旬寻巡询循吟垠银淫寅云匀芸耘'.split(''),
  '本蠢粉滚磙很仅尽紧锦谨肯垦啃捆壶凛皿抿闽敏品寝忍荏损笋沈审婶哂吮刎吻紊稳尹引饮蚓殷隐瘾允陨怎诊枕疹缜准墩'.split(''),
  '奔苯摈膑殡鬓衬称寸囤沌钝盾顿遁分份愤奋忿粪亘艮棍恨诨混仅妗尽进近劲荩晋烬浸禁觐噤俊菌郡竣浚困吝赁淋闷焖懑恁嫩论喷聘沁亲刃认仞任妊润闰肾甚顺舜瞬问信衅训迅汛讯驯逊殉浚印饮荫孕运晕酝愠韵譖阵鸩振朕赈震镇'.split(''),
]
const yun11 = [
  '庚并崩伻冰槟屏称撑灯登蹬镫丁仃叮盯钉酊丰风封枫疯峰烽锋蜂更耕羹亨哼精茎惊京经晴泾荆旌晶粳兢鲸坑吭铿蒙抨怦砰烹嘭乒俜青轻倾卿清扔僧生声牲胜笙甥厅汀听翁嗡兴星腥猩惺应英莺婴樱鹦膺鹰曾增憎正争征怔挣峥狰症睁筝蒸'.split(''),
  '层曾成丞呈诚承城乘盛程惩澄橙冯逢缝恒姮横衡楞棱伶灵泠玲令凌陵聆菱棂蛉羚绫零龄翎龙氓虻萌蒙盟瞢薨艨名茗明鸣冥铭瞑暝能宁拧咛狞凝平彭膨澎棚蓬鹏篷评坪苹凭屏瓶萍情晴擎仍绳疼腾誊藤廷亭庭停蜓婷霆刑行形邢陉迎荧盈萤荧萦楹蝇赢瀛'.split(''),
  '绷丙秉柄饼炳屏秉逞骋等戥顶酊鼎讽埂耿鲠梗井阱颈刭景警冷令岭领梦猛艋蠓蒙懵酩捧顷请省挺艇醒擤影颖拯整'.split(''),
  '泵迸蚌蹦并病摒秤邓凳澄磴蹬订钉定锭凤奉俸缝更横劲径净胫痉竞竟敬靖静境獍镜另令愣孟梦命宁佞拧泞碰庆罄磬圣胜乘盛剩瓮兴杏幸姓性应映硬赠正证郑怔政諍挣症'.split(''),
]
const yun12 = [
  '低羝堤提几讥机肌鸡奇屐姬基期稽畸箕齑嵇饥羁咪眯妮丕批披批砒沏妻栖期梯蹊欺兮西溪希稀熙牺唏嘻樨羲曦醯伊医衣依旖噫'.split(''),
  '厘狸离梨鹂骊犁漓璃黎藜罹篱蠡迷弥眯谜糜尼泥呢妮霓皮疲毗蚍啤琵脾罴鼙齐祈歧祁其奇畦骑棋旗麒提啼题蹄仪夷圯迤饴怡宜贻沂姨蛇移遗颐疑彝'.split(''),
]
const yun13 = [
  '哧鸱嗤痴魑呲差疵尸师狮施司丝私思咝鸶斯撕嘶之知支芝枝肢脂蜘仔咨姿滋生兹资缁辎孳'.split(''),
  '吃失虱湿只汁织'.split(''),
  '池弛驰迟持匙墀踟词瓷辞慈磁雌时埘'.split(''),
  '直侄值职植殖絷跖踟掷'.split(''),
  '齿侈耻此史使矢始驶屎死止祉只咫旨指纸趾子仔籽姊秭紫梓滓尺'.split(''),
  '炽翅次伺刺赐士氏示世仕市式似事势侍试视柿拭是恃逝誓舐弑谥嗜巳四寺似姒饲耜祀泗驷食肆嗣至识帜制桎治峙致痔智痣滞彘置雉稚自挚志质字恣眦渍'.split(''),
]
const yun14 = [
  '初粗都夫肤麸鄜孵敷估姑咕沽孤轱鸪菇辜箍乎呼戏糊枯骷撸嚕铺书抒纾枢姝殊梳舒输疏蔬苏酥乌污呜於巫诬恶朱诛珠株诸铢猪蛛租'.split(''),
  '出督忽惚哭窟仆扑噗叔倏菽淑凸突秃屋'.split(''),
  '刍除厨锄滁蜍躇雏凫扶俘浮蚨蜉桴符蜉芙狐弧胡和壶葫糊蝴湖卢芦庐垆炉沪模奴匍菩葡脯如茹儒嚅孺襦图荼徒途凃屠无毋芜吾吴捂唔梧蜈'.split(''),
  '毒独读渎椟牍黩犊佛幅袱拂拂伏服匐福孰赎塾熟俗竹术竺逐烛舳足卒族'.split(''),
  '补捕哺堡处杵础储楚肚堵赌父睹抚拊斧府俯釜辅腑腐古股牯贾蛊鼓瞽虎浒苦鲁橹虏母牡亩姆姥努普谱汝乳暑黍署鼠数薯曙土吐午五伍忤妩武侮捂鹉舞主拄渚煮诅阻组俎祖卜笃谷骨朴辱属蜀瞩'.split(''),
  '布怖步部薄醋杜妒度渡镀蠹父付负妇附副赋富固故顾雇锢户互库裤绔路赂露鹭暮幕募墓慕怒铺树竖塑数墅素诉溯兔吐务悟误晤雾坞骛伫助住贮杼注驻柱炷著蛀铸畜矗触黜促卒猝复腹覆缚馥酷六陆鹿绿禄碌麓戮木目沐牧睦穆瀑曝入术怵束述夙肃宿粟缩簌物勿筑祝'.split(''),
]
const yun16 = [
  '居车且拘驹俱疽据区岖驱祛蛆躯趋黢吁须虚嘘墟迂淤曲屈掬鞠戌'.split(''),
  '驴闾劬渠蕖瞿衢徐于予妤余欤盂臾鱼竽谀娱渔隅揄喁畬逾腴渝愉榆瑜虞愚觎舆局桔菊橘曲'.split(''),
  '咀沮举龃吕侣铝旅屡缕履女取许诩栩与予屿宇羽雨禹语龉龃圄曲'.split(''),
  '巨句聚拒具炬沮俱据倨距惧飓锯滤虑女趣去觑序叙酗绪絮煦婿与玉驭芋吁妪雨语预喻御寓裕愈豫遇誉剧律绿率旭畜蓄恤续蓿玉郁育狱浴域欲'.split(''),
  '吗'.split(''),
]
async function main() {
  const s = new Set()
  for (const l of yun16) {
    for (const w of l) {
      const py = pinyin(w, { style: pinyin.STYLE_TONE2 })
      s.add(vowel(py[0][0]))
    }
  }
  console.log(s)
  console.log(pinyin('吧，吗，啊，阿，呢', { style: pinyin.STYLE_TONE2 }))
}

main()
